Repository: roman-yakimkin/palom-d7
Catalog: sites/all/translations/bueditor-7.x-1.8.*.po
Languages: ru

source: Title
ru: Заголовок

source: Save configuration
ru: Сохранить конфигурацию

source: Delete
ru: Удалить

source: Operations
ru: Операции

source: Content
ru: Содержимое

source: Cancel
ru: Отмена

source: Go
ru: Пуск

source: Edit
ru: Редактировать

source: Search
ru: Поиск

source: This action cannot be undone.
ru: Это действие нельзя отменить.

source: Weight
ru: Вес

source: Import
ru: Импортировать

source: Export
ru: Экспортировать

source: Icon
ru: Иконка

source: n/a
ru: н/д

source: User role
ru: Роль

source: Demo
ru: Демо

source: This field is required.
ru: Это поле обязательно для заполнения.

source: Close
ru: Закрыть

source: Visibility settings
ru: Настройки видимости

source: Browse
ru: Обзор

source: Key
ru: Ключ

source: File Browser
ru: Файловый браузер

source: The changes have been saved.
ru: Изменения сохранены.

source: Replace
ru: Заменить

source: Customize your text editor.
ru: Настройте ваш текстовый редактор.

source: Add new editor
ru: Добавить новый редактор

source: Editor name
ru: Название редактора

source: Available editors
ru: Доступные редакторы

source: Assigned editor
ru: Назначенный редактор

source: Show the editor on specific pages
ru: Показать редактор на определенных страницах

source: Enter one page per line as Drupal paths. The * character is a wildcard.
ru: Введите пути Drupal по одному на строку. Используйте * для обозначения любой последовательности символов.

source: Hide the editor for specific textareas
ru: Скрывать редактор для указанных текстовых областей

source: Enter one textarea ID per line. The * character is a wildcard.
ru: Введите по одному ID текстовой области на строку. Используйте * для обозначения любой последовательности символов.

source: New buttons are ready to be saved.
ru: Новые кнопки готовы к сохранению.

source: ... selecteds
ru: ... с выбранными

source: CSV file containing the buttons
ru: файл CSV с кнопками

source: Buttons
ru: Кнопки

source: Import Buttons
ru: Импортировать кнопки

source: Selected buttons have been deleted.
ru: Выбранные кнопки были удалены.

source: There is no button to export.
ru: Нет кнопки для экспорта.

source: A plain textarea editor aiming to facilitate code writing.
ru: Простой редактор текстового поля, нацеленный на облегчение написания кода.

source: Loading...
ru: Загрузка...

source: Copy
ru: Копировать

source: Alternative editor
ru: Альтернативный редактор

source: Role-editor assignments
ru: Назначения редакторов для ролей

source: Assign editors to user roles.
ru: Назначить редакторы для пользовательских ролей.

source: Alternative editor makes it possible to use different editors for different textareas or different editors on diffrent pages. You just have to configure visibility settings for each editor.
ru: Альтернативный редактор позволяет использовать разные редакторы для разных текстовых областей на разных страницах. Вам лишь необходимо настроить видимость для каждого редактора.

source: Directory of editor icons
ru: Каталог для иконок редактора

source: Web accessible directory path where editor icons reside.
ru: Адрес доступного извне каталога, в котором находятся иконки.

source: Placeholders that you can use are; %BUEDITOR (bueditor path), %FILES (drupal files path), and %THEME (current theme's path).
ru: Вы можете использовать следующие выражения для замены: %BUEDITOR (путь к каталогу BUEditor), %FILES (путь к каталогу файлов Drupal), %THEME (путь к каталогу текущей темы оформления).

source: Editor paths
ru: Пути редактора

source: Editor settings
ru: Настройки редактора

source: Delete editor
ru: Удалить редактор

source: Overwrite
ru: Перезаписать

source: The preview is disabled due to previously inserted HTML code in the content. This aims to protect you from any potentially harmful code inserted by other editors or users. If you own the content, just preview an empty text to re-enable the preview.
ru: Предварительный просмотр отключен в связи с ранее вставленным кодом HTML в содержание. Эта деятельность направлена на защиту от любого потенциально вредного кода добавлено в редактором или другим пользователем. Если у вас есть содержание, оставьте пустыми текст просмотра, чтобы снова включить preview.

source: Preview requires <a href="http://drupal.org/project/ajax_markup">Ajax markup</a> module with proper permissions set.
ru: Предпросмотр нуждается в модуле <a href="http://drupal.org/project/ajax_markup">Ajax markup</a> с правильно установленными правами.

source: Import editor
ru: Импорт редактора

source: Add the default editor
ru: Добавить редактор по умолчанию

source: Editor specific library files
ru: Файлы расширения

source: Enable CSS sprites
ru: Включить CSS спрайты

source: <a href="http://www.alistapart.com/articles/sprites">What are CSS sprites?</a>. The sprites will be stored in %dir.
ru: <a href="http://www.alistapart.com/articles/sprites">Что такое CSS спрайты</a>. Спрайты будут храниться в %dir.

source: There is no button to import.
ru: Не существует кнопок для импорта.

source: <em>You can either upload a CSV file exported from BUEditor 6.x-1.x or earlier</em> !csvfield <em>OR paste the editor code containing the buttons</em> !codefield
ru: <em>Вы можете загрузить CSV файл экспортированный из BUEditor 6.x-1.x или более старой версии</em> !csvfield <em>Или вставьте код, содержащий описание кнопок, в редактор ниже</em> !codefield

source: Copy to editor
ru: Копировать в редактор

source: Editor code
ru: Редактор кода

source: Enter previously exported editor code.
ru: Введите ранее экспортированный код.

source: The code will be scanned for only buttons and all other data will be ignored.
ru: Код будет сканироваться только на наличие кнопок, а все остальные данные будут проигнорированы.

source: This code will be evaluated as PHP, therefore you must be sure that it is harmless and produces proper editor data.
ru: Этот код будет расцениваться как PHP, поэтому вы должны быть уверены, что он не представляет опасности и содержит только данные редактора.

source: The editor code did not produce proper editor data.
ru: Редактор кода не производит собственных данных.

source: Are you sure you want to delete the editor @name?
ru: Вы уверены, что хотите удалить редактор @name?

source: All buttons and settings of this editor will be removed.
ru: Все настройки и кнопки редактора будут удалены.

source: Editor %name has been deleted.
ru: Редактор %name удалён.

source: Directory of editor files
ru: Папка файлов редактора

source: Editor code (PHP)
ru: Редактор кода (PHP)

source: Editor %name has been added.
ru: Редактор %name добавлен

source: Text button
ru: Текстовая кнопка

source: Are you sure want to delete the selected buttons?
ru: Вы уверены, что хотите удалить выбранные кнопки?

source: Select an icon
ru: Выберите значок

source: You can use these quick-import templates: !list
ru: Вы можете использовать этот шаблон быстрого импорта: !list

source: No matching phrase found!
ru: Соответствий не найдено

source: Replace this occurance of "!text"?
ru: Заменить это вхождение "!text"?

source: Total replacements: !count
ru: Число замен: !count

source: Find & Replace
ru: Поиск и Замена

source: End of textarea reached. Continue search at the beginning of textarea?
ru: Достигнут конец редактора. Продолжить поиск сначала?

source: Match case
ru: Учитывать регистр

source: Regular expressions
ru: Регулярные выражения

source: Find next
ru: Искать далее

source: Replace all
ru: Заменить всё

source: Send to editor
ru: Послать в редактор

source: Tag editor - @tag
ru: Тег редактора - @tag

source: Site maintenance account
ru: Учётная запись обслуживания сайта

source: Content authoring
ru: Работа с содержимым

source: Administer BUEditor
ru: Управление BUEditor

source: Settings for the editor @name
ru: Настройки редактора @name
